#include "Fun.h"


void Sys_reset(void)
{
		/*1.继电器处于直通位置
			2.AD 5292复位
			3.液晶屏复位
			4.模拟开关关闭	
	*/
	uint16_t Returnx;																			//定义局部变量
	uint16_t i=0;																					//定义局部变量
	uint16_t j=0;																					//定义局部变量	
	
/*=================继电器直通控制===============*/
	for(j=0;j<6;j++)																			//关闭所有的继电器
	{
		Relay_OFF (0x8000>>j);
		delay_ms(200);
	}
/*=================AD5292复位控制===============*/	
	for(i=0;i<6;i++)
	{
		Returnx=Write_CMD(0x0001<<i,0x1803);								//所有通道的AD5292复位(CS from PE0-PE5)
		Returnx=Write_CMD(0x0001<<i,0x1000);								//RDAC 复位
	}
/*=================液晶复位控制===============*/	
	
	
	
}

